// @strict-types
#Область ПрограммныйИнтерфейс

// Вызывает исключение для сообщения о том что
// Процедура или Функция существует только для определения типа.
Процедура ОшибкаТолькоДляОпределения() Экспорт
	ВызватьИсключение "Процедура или Функция существует только для определения типа.";
КонецПроцедуры

// Определение базовых типов данных.
// 
// Возвращаемое значение:
// 	Строка
//  см. StringИмя
//  см. NumberИмя
//  см. IntegerИмя
//  см. BooleanИмя
//  см. ArrayИмя
//  см. ObjectИмя
Функция ОпределениеБазовыхТиповДанных() Экспорт
	ОшибкаТолькоДляОпределения();
	Возврат "";
КонецФункции


// Numeric структура определения.
// 
// Возвращаемое значение:
//  Структура:
//		*type - см. NumberИмя, см. IntegerИмя -
//		*minimum - Число, Неопределено -
//		*maximum - Число, Неопределено -
//		*exclusiveMinimum - Булево, Неопределено -
//		*exclusiveMaximum - Булево, Неопределено -
//		*multipleOf - Число, Неопределено -
Функция NumericСтруктураОпределения() Экспорт
	ОшибкаТолькоДляОпределения();
	//@skip-check constructor-function-return-section
	Возврат "";
КонецФункции

// String структура определения.
// 
// Возвращаемое значение:
//  Структура:
//		*type - см. StringИмя
//		*minLength - Число, Неопределено -
//		*maxLength - Число, Неопределено -
//		*format - Строка, Неопределено -
//		*exclusiveMaximum - Булево, Неопределено -
//		*multipleOf - Число, Неопределено -
Функция StringСтруктураОпределения() Экспорт
	ОшибкаТолькоДляОпределения();
	//@skip-check constructor-function-return-section
	Возврат "";
КонецФункции

#Область БазовыеТипыДанных

// String имя.
// 
// Возвращаемое значение:
//  Строка - "string"
Функция StringИмя() Экспорт
	Возврат "string";
КонецФункции

// Number имя.
// 
// Возвращаемое значение:
//  Строка - "number"
Функция NumberИмя() Экспорт
	Возврат "number";
КонецФункции

// Integer имя.
// 
// Возвращаемое значение:
//  Строка - "integer"
Функция IntegerИмя() Экспорт
	Возврат "integer";
КонецФункции

// Boolean имя.
// 
// Возвращаемое значение:
//  Строка - "boolean"
//@skip-check module-unused-method
Функция BooleanИмя() Экспорт
	Возврат "boolean";
КонецФункции

// Array имя.
// 
// Возвращаемое значение:
//  Строка - "array"
Функция ArrayИмя() Экспорт
	Возврат "array";
КонецФункции

// Object имя.
// 
// Возвращаемое значение:
//  Строка - "object"
Функция ObjectИмя() Экспорт
	Возврат "object";
КонецФункции
#КонецОбласти
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти