// @strict-types
#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.УчебныеГруппы
Функция Получить(УИД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчебныеГруппы.Ссылка
	|ИЗ
	|	Справочник.УчебныеГруппы КАК УчебныеГруппы
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(УчебныеГруппы.Ссылка) = &УИД";

	Запрос.УстановитьПараметр("УИД", УИД);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Ссылка;
КонецФункции

// Получить по студенту.
// 
// Параметры:
//  Студент - СправочникСсылка.Студенты
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.УчебныеГруппы
Функция ПолучитьПоСтуденту(Студент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеКонтингентаСрезПоследних.Группа
	|ИЗ
	|	РегистрСведений.ДвижениеКонтингента.СрезПоследних КАК ДвижениеКонтингентаСрезПоследних
	|ГДЕ
	|	ДвижениеКонтингентаСрезПоследних.Студент = &Студент";
	
	Запрос.УстановитьПараметр("Студент", Студент);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Группа;
КонецФункции
#КонецОбласти