#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.ВидыНагрузки
Функция Получить(УИД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНагрузки.Ссылка
	|ИЗ
	|	Справочник.ВидыНагрузки КАК ВидыНагрузки
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыНагрузки.Ссылка) = &УИД";
	
	Запрос.УстановитьПараметр("УИД", УИД);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	//@skip-check property-return-type
	Возврат Выборка.Ссылка;
КонецФункции
#КонецОбласти
