// @strict-types
#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - ДокументСсылка.РасписаниеНаДату
Функция Получить(УИД) Экспорт
	РасписаниеНаДату = Документы.РасписаниеНаДату.ПолучитьСсылку(УИД);

	//@skip-check reading-attribute-from-database
	Если РасписаниеНаДату.ПолучитьОбъект() = Неопределено Или Не РасписаниеНаДату.Проведен
		Или РасписаниеНаДату.ПометкаУдаления Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РасписаниеНаДату;
КонецФункции

// Получить по дате расписания.
// 
// Параметры:
//  ДатаРасписания - Дата
// 
// Возвращаемое значение:
//  - Неопределено
//  - ДокументСсылка.РасписаниеНаДату
Функция ПолучитьПоДатеРасписания(ДатаРасписания) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасписаниеНаДату.Ссылка
	|ИЗ
	|	Документ.РасписаниеНаДату КАК РасписаниеНаДату
	|ГДЕ
	|	РасписаниеНаДату.ДатаРасписания = &ДатаРасписания
	|	И РасписаниеНаДату.Проведен = ИСТИНА
	|	И РасписаниеНаДату.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ДатаРасписания", ДатаРасписания);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Ссылка;
КонецФункции
#КонецОбласти