// @strict-types

#Область ПрограммныйИнтерфейс

// Исключить неопределено.
// 
// Параметры:
//  Значение - Произвольный
//  СообщениеИсключения - Строка
// 
// Возвращаемое значение:
//  Произвольный
Функция ИсключитьНеопределено(Значение, СообщениеИсключения) Экспорт
	Если Значение = Неопределено Тогда
		ВызватьИсключение СообщениеИсключения;
	КонецЕсли;
	Возврат Значение;
КонецФункции

// Получить УИДСсылки.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка, Неопределено -
// 
// Возвращаемое значение:
//  - УникальныйИдентификатор
//  - Неопределено
Функция ПолучитьУИДСсылки(Ссылка) Экспорт
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Ссылка.УникальныйИдентификатор();
КонецФункции

#КонецОбласти