#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.РасписанияЗвонков
Функция Получить(УИД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасписанияЗвонков.Ссылка
	|ИЗ
	|	Справочник.РасписанияЗвонков КАК РасписанияЗвонков
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасписанияЗвонков.Ссылка) = &УИД";

	Запрос.УстановитьПараметр("УИД", УИД);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Ссылка;
КонецФункции
#КонецОбласти