// @strict-types
#Область ПрограммныйИнтерфейс

// Имя типа String.
// 
// Возвращаемое значение:
//  Строка - "string"
Функция Имя() Экспорт
	Возврат "string";
КонецФункции

// Cтруктура определения типа String.
// 
// Возвращаемое значение:
//  Структура:
//		*type - см. StringИмя
//		*minLength - Число, Неопределено -
//		*maxLength - Число, Неопределено -
//		*format - Строка, см. ФорматМодификаторИмена, Неопределено -
//		*pattern - Строка, Неопределено -
Функция СтруктураОпределения() Экспорт
	оас_ТипыДанных.ОшибкаТолькоДляОпределения();
	//@skip-check constructor-function-return-section
	Возврат "";
КонецФункции

#Область ФорматМодификатор

// Имена модификатора Формат.
// 
// Возвращаемое значение:
//  Строка
//	см. ФорматМодификатор_ИмяDate
//	см. ФорматМодификатор_ИмяDateTime
//	см. ФорматМодификатор_ИмяPassword
//	см. ФорматМодификатор_ИмяByte
//	см. ФорматМодификатор_ИмяBinary
Функция ФорматМодификаторИмена() Экспорт
	оас_ТипыДанных.ОшибкаТолькоДляОпределения();
	Возврат "";
КонецФункции

// Имя Date модификатора Формат.
// 
// Возвращаемое значение:
//  Строка - "date"
Функция ФорматМодификатор_ИмяDate() Экспорт
	Возврат "date"
КонецФункции

// Имя DateTime модификатора Формат.
// 
// Возвращаемое значение:
//  Строка - "date-time"
Функция ФорматМодификатор_ИмяDateTime() Экспорт
	Возврат "date-time"
КонецФункции

// Имя Password модификатора Формат.
// 
// Возвращаемое значение:
//  Строка - "password"
Функция ФорматМодификатор_ИмяPassword() Экспорт
	Возврат "password"
КонецФункции

// Имя Byte модификатора Формат.
// 
// Возвращаемое значение:
//  Строка - "byte"
Функция ФорматМодификатор_ИмяByte() Экспорт
	Возврат "byte"
КонецФункции

// Имя Binary модификатора Формат.
// 
// Возвращаемое значение:
//  Строка - "binary"
Функция ФорматМодификатор_ИмяBinary() Экспорт
	Возврат "binary"
КонецФункции

#КонецОбласти

#КонецОбласти